src/Catalogs/ПрайсЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПрайсЛист</Name>
			<Comment>Прайс-лист товаров</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыПрайсЛистов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Элемент номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ПартииТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровКомпании</Name>
			<Comment>Блок учета партий товаров компании собственных и принятых на комиссию</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток товара на складе в разрезе партий</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Comment>Сумма в валюте регламентированного учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСУпр</Name>
					<Comment>Сумма НДС в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДСУпр</Name>
					<Comment>Сумма в валюте управленческого учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия, по которой поступил или был взят на комиссию товар</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Catalogs/ПрайсЛист/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Прайс лист"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Заполняет прайс-лист в соответствии с переданными параметрами заполнения
// ВладелецПрайсЛиста - вид прайс-листа, который заполняем
// СпособЗаполнения:  0 - по складским остаткам, 1 - по товарам поставщика, 2 - по справочнику
// "Номенклатура", 3 - копирование другого прайс-листа  
// Параметры заполнения - структура: зависит от способа заполнения, ключи - Склад, Дата,
// Поставщик, ГруппаНоменклатуры,ВидПрайсЛиста  
// Способ создания групп: 0 - не создавать, 1 - создавать по видам товаров, 2 - создавать по группам товаров
// Текущий родитель - текущий родитель прайс-листа
// ФлОчищать = Истина,если текущий прайс-лист будет очищен перед заполнением.
//
// Параметры:
// ВладелецПрайсЛиста 	- Строка 			- Вид прайс-листа
// СпособЗаполнения 	- Число 			- Способ заполнения
// ПараметрыЗаполнения 	- Структура 		- Параметры заполнения  
// СпособСозданияГрупп 	- Число 			- Способ создания групп
// Текущий родитель 	- СправочникСсылка	- Текущий родитель прайс-листа
// ФлОчищать 			- Булево			- Флаг очистки прайс-листа перед заполнением.
//
Процедура ЗаполнитьПрайсЛист(ВладелецПрайсЛиста, СпособЗаполнения, ПараметрыЗаполнения, СпособСозданияГрупп = 2, ФлажокОчищать = Истина,ТекущийРодитель = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВладелецПрайсЛиста) Тогда
		ВывестиСообщение(НСтр("ru='Не задан владелец прайс-листа.'"));
		Возврат
	КонецЕсли;
	
	// очистим если надо
	Если ФлажокОчищать Тогда
		УдаляемыеЭлементы = Новый СписокЗначений;
		Запрос=Новый Запрос("ВЫБРАТЬ
			|	ПрайсЛист.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ПрайсЛист КАК ПрайсЛист
			|ГДЕ
			|	ПрайсЛист.Владелец = &ИсходныйВладелец");
		Запрос.УстановитьПараметр("ИсходныйВладелец",ВладелецПрайсЛиста);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Ссылка.Уровень()=0 Тогда
				УдаляемыеЭлементы.Добавить(Выборка.Ссылка);
			КонецЕсли;
		КонецЦикла;
		Для Каждого УдаляемЭлемент Из УдаляемыеЭлементы Цикл
			УдаляемЭлементОбъект = УдаляемЭлемент.Значение.ПолучитьОбъект();
			УдаляемЭлементОбъект.Удалить();
		КонецЦикла;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПараметрыЗаполнения) Тогда
		ПараметрыЗаполнения = Новый Структура();
	КонецЕсли;
	Если НЕ ПараметрыЗаполнения.Свойство("Склад") Тогда
		ПараметрыЗаполнения.Вставить("Склад");
	КонецЕсли;
	Если НЕ ПараметрыЗаполнения.Свойство("Дата") Тогда
		ПараметрыЗаполнения.Вставить("Дата");
	КонецЕсли;
	Если НЕ ПараметрыЗаполнения.Свойство("Поставщик") Тогда
		ПараметрыЗаполнения.Вставить("Поставщик");
	КонецЕсли;
	Если НЕ ПараметрыЗаполнения.Свойство("ГруппаНоменклатуры") Тогда
		ПараметрыЗаполнения.Вставить("ГруппаНоменклатуры");
	КонецЕсли;
	Если НЕ ПараметрыЗаполнения.Свойство("ВидПрайсЛиста") Тогда
		ПараметрыЗаполнения.Вставить("ВидПрайсЛиста");
	КонецЕсли;
	
	// Получим значения структуры
	Склад              = ПараметрыЗаполнения.Склад;
	Дата               = ПараметрыЗаполнения.Дата;
	Поставщик          = ПараметрыЗаполнения.Поставщик;
	ГруппаНоменклатуры = ПараметрыЗаполнения.ГруппаНоменклатуры;
	ВидПрайсЛиста      = ПараметрыЗаполнения.ВидПрайсЛиста;
	
	// Непосредственно заполнение
	Запрос = Новый Запрос;
	СкладПустой  = НЕ ЗначениеЗаполнено(Склад); 
	ГруппаПустая = НЕ ЗначениеЗаполнено(ГруппаНоменклатуры);
	Если СпособЗаполнения = 0 Тогда // по остаткам
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|   ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Ссылка,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Код КАК КодНоменклатуры,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|   ОстаткиТоваровКомпанииОстатки.Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
		|   ОстаткиТоваровКомпанииОстатки.Номенклатура.Родитель КАК Родитель,
		|   ОстаткиТоваровКомпанииОстатки.Номенклатура.Наименование КАК Наименование
		|ИЗ
		|   РегистрНакопления.ОстаткиТоваровКомпании.Остатки(" + ?(НЕ ЗначениеЗаполнено(Дата),",","&Дата,")
			+ ?(СкладПустой,"","СкладКомпании = &Склад")+ ?(Не СкладПустой И Не ГруппаПустая," И ","")+ ?(ГруппаПустая, ")", "Номенклатура В ИЕРАРХИИ(&ГруппаНоменклатуры))") + " КАК ОстаткиТоваровКомпанииОстатки
		|ГДЕ НЕ ОстаткиТоваровКомпанииОстатки.Номенклатура.Наименование ЕСТЬ NULL
		|ИТОГИ ПО Ссылка ТОЛЬКО ИЕРАРХИЯ АВТОУПОРЯДОЧИВАНИЕ";
		
	ИначеЕсли СпособЗаполнения = 1 Тогда //по поставщику
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПартииТоваровКомпании.Номенклатура КАК Ссылка,
		|	ПартииТоваровКомпании.Номенклатура.Код КАК КодНоменклатуры,
		|	ПартииТоваровКомпании.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ПартииТоваровКомпании.Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
		|	ПартииТоваровКомпании.Номенклатура.Родитель КАК Родитель,
		|	ПартииТоваровКомпании.Номенклатура.Наименование КАК Наименование
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
		|ГДЕ НЕ ПартииТоваровКомпании.Номенклатура.Наименование ЕСТЬ NULL
		|	И (ПартииТоваровКомпании.ХозОперация=&ХозОперация И ПартииТоваровКомпании.СкладКомпании.Розничный) " + ?(НЕ ЗначениеЗаполнено(Поставщик),"","И ПартииТоваровКомпании.Регистратор.Контрагент = &Контрагент ") 
		 + ?(ГруппаПустая,"","И ПартииТоваровКомпании.Номенклатура В ИЕРАРХИИ(&ГруппаНоменклатуры)")+"
		|СГРУППИРОВАТЬ ПО Номенклатура
		|ИТОГИ ПО
		|	Ссылка ТОЛЬКО ИЕРАРХИЯ АВТОУПОРЯДОЧИВАНИЕ";
		
	ИначеЕсли СпособЗаполнения = 2 Тогда // по номенклатуре
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Код КАК КодНоменклатуры,
		|	ВидНоменклатуры КАК ВидНоменклатуры,
		|	ЭтоГруппа КАК ЭтоГруппа,
		|	Родитель КАК Родитель,
		|	Наименование КАК Наименование,
		|	Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура" + ?(ГруппаПустая, "", " ГДЕ Ссылка В ИЕРАРХИИ(&ГруппаНоменклатуры) ") + "
		|УПОРЯДОЧИТЬ ПО Ссылка ИЕРАРХИЯ АВТОУПОРЯДОЧИВАНИЕ";
	ИначеЕсли СпособЗаполнения = 3 Тогда // по другому виду прайс-листа
		Если НЕ ЗначениеЗаполнено(ВидПрайсЛиста)Тогда
			ВывестиСообщение(НСтр("ru='Не задан исходный вид прайс-листа.'"));
			Возврат;
		КонецЕсли;
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрайсЛист.Код КАК КодНоменклатуры,
		|	ПрайсЛист.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ПрайсЛист.ЭтоГруппа,
		|	ПрайсЛист.Родитель,
		|	ПрайсЛист.Наименование,
		|	ПрайсЛист.Ссылка КАК ПрайсЛистСсылка, 
		|	ВЫБОР КОГДА ПрайсЛист.ЭтоГруппа
		|	ТОГДА
		|		ПрайсЛист.Ссылка 
		|	ИНАЧЕ
		|		ПрайсЛист.Номенклатура
		|	КОНЕЦ КАК Ссылка
		|ИЗ
		|	Справочник.ПрайсЛист КАК ПрайсЛист
		|ГДЕ
		|	ПрайсЛист.Владелец = &ВидПрайсЛиста";
		Если НЕ ГруппаПустая Тогда ТекстЗапроса = ТекстЗапроса + " И ПрайсЛист.Номенклатура В ИЕРАРХИИ(&ГруппаНоменклатуры) "; КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|
		|УПОРЯДОЧИТЬ ПО ПрайсЛистСсылка ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ГруппаНоменклатуры", ГруппаНоменклатуры);
	Запрос.УстановитьПараметр("Контрагент",Поставщик);
	Запрос.УстановитьПараметр("ВидПрайсЛиста",ВидПрайсЛиста);
	Запрос.УстановитьПараметр("ХозОперация",Справочники.ХозОперации.ПоступлениеТоваров);
	ТаблицаЗаполнения = Запрос.Выполнить().Выгрузить();
	СоответствиеГрупп = Новый Структура;
	Всего = ТаблицаЗаполнения.Количество();
	Счетчик = 0;
	
	// Если у владельца стоит флаг уникальности и не очищать прайс-лист, заполним соответствие.
	Если ВладелецПрайсЛиста.ФлагУникальности И НЕ ФлажокОчищать И (СпособСозданияГрупп = 2 ИЛИ СпособСозданияГрупп = 1) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрайсЛист.Ссылка,
		|	ПрайсЛист.Наименование,
		|	ПрайсЛист.Номенклатура.Код КАК Код
		|ИЗ
		|	Справочник.ПрайсЛист КАК ПрайсЛист
		|ГДЕ
		|	ПрайсЛист.Владелец = &Владелец
		|	И ПрайсЛист.ЭтоГруппа = ИСТИНА");
		Запрос.УстановитьПараметр("Владелец", ВладелецПрайсЛиста);
		ВыборкаГруппПрайса = Запрос.Выполнить().Выбрать();
		Пока ВыборкаГруппПрайса.Следующий() Цикл
			Если СпособСозданияГрупп = 2 Тогда 
				ГруппаНоменклатуры = Справочники.Номенклатура.НайтиПоНаименованию(ВыборкаГруппПрайса.Наименование);
				Если ГруппаНоменклатуры.Пустая() Тогда
					Продолжить
				Иначе
					ИмяГруппыВыборки = ГруппаНоменклатуры.Код;
				КонецЕсли;
			Иначе
				ИмяГруппыВыборки = ВыборкаГруппПрайса.Наименование;
			КонецЕсли;
			ИмяГруппыВыборки = "К_" + СокрЛП(СтрЗаменить(ИмяГруппыВыборки," ","_"));
			Если СоответствиеГрупп.Свойство(ИмяГруппыВыборки) Тогда
				Продолжить;
			Иначе
				СоответствиеГрупп.Вставить(ИмяГруппыВыборки,ВыборкаГруппПрайса.Ссылка);
			КонецЕсли
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Стр Из ТаблицаЗаполнения Цикл
		
		// Уберем общий итог, если группа не задана.
		Если Стр.Наименование = NULL Тогда
			Продолжить
		КонецЕсли;
		
		Родитель = Неопределено;
		Если ЗначениеЗаполнено(ТекущийРодитель) Тогда
			Если СтрНайти(Строка(ТекущийРодитель), НСтр("ru = 'Объект не найден'")) = 0 Тогда
				Родитель = ТекущийРодитель;
			КонецЕсли;
		КонецЕсли;
		
		Если СпособСозданияГрупп = 1 И Не Стр.ЭтоГруппа Тогда
			ИмяГруппы = СтрЗаменить(СокрЛП(Строка(Стр.ВидНоменклатуры))," ","_");
			Если ПустаяСтрока(ИмяГруппы) Тогда
				ИмяГруппы = "Неопределенный_вид";
			КонецЕсли;
			Группа = Неопределено;
			Если СоответствиеГрупп.Свойство("К_"+ИмяГруппы, Группа) Тогда
				Родитель = Группа;
			Иначе
				НоваяГруппа = Справочники.ПрайсЛист.СоздатьГруппу();
				НоваяГруппа.Владелец = ВладелецПрайсЛиста;
				НоваяГруппа.УстановитьНовыйКод();
				НоваяГруппа.Наименование = СтрЗаменить(ИмяГруппы,"_"," ");
				Если Не Родитель = Неопределено Тогда
					НоваяГруппа.Родитель = Родитель;
				КонецЕсли;
				НоваяГруппа.Записать();
				СоответствиеГрупп.Вставить("К_"+ИмяГруппы, НоваяГруппа.Ссылка);
				Родитель = НоваяГруппа.Ссылка;
			КонецЕсли;
		ИначеЕсли СпособСозданияГрупп = 2 И Стр.ЭтоГруппа Тогда
			Если СпособЗаполнения = 0 И ЗначениеЗаполнено(ГруппаНоменклатуры) Тогда
				Если ГруппаНоменклатуры.ПринадлежитЭлементу(Стр.Ссылка) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			ИмяГруппы = СокрЛП(Стр.КодНоменклатуры);
			Группа = Неопределено;
			Если СоответствиеГрупп.Свойство("К_"+ИмяГруппы, Группа) Тогда
				Родитель = Группа;
			Иначе
				НоваяГруппа = Справочники.ПрайсЛист.СоздатьГруппу();
				НоваяГруппа.Владелец = ВладелецПрайсЛиста;
				НоваяГруппа.УстановитьНовыйКод();
				НоваяГруппа.Наименование = Стр.Наименование;
				Если ЗначениеЗаполнено(Стр.Родитель) Тогда
					Если СоответствиеГрупп.Свойство("К_" + СокрЛП(СтрЗаменить(Стр.Родитель.Код," ","_")), Группа) Тогда
						НоваяГруппа.Родитель = Группа;
					Иначе
						Если Не Родитель = Неопределено Тогда
							НоваяГруппа.Родитель = Родитель;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если Не Родитель = Неопределено Тогда
						НоваяГруппа.Родитель = Родитель;
					КонецЕсли;
				КонецЕсли;
				НоваяГруппа.Записать();
				СоответствиеГрупп.Вставить("К_"+ИмяГруппы, НоваяГруппа.Ссылка);
				Родитель = НоваяГруппа.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		Если Не Стр.ЭтоГруппа Тогда
			НовыйЭлемент = Справочники.ПрайсЛист.СоздатьЭлемент();
			НовыйЭлемент.Владелец = ВладелецПрайсЛиста;
			НовыйЭлемент.УстановитьНовыйКод();
			НовыйЭлемент.Наименование = Стр.Наименование;
			НовыйЭлемент.Номенклатура = Стр.Ссылка;
			
			Группа = Неопределено;
			Если ЗначениеЗаполнено(Стр.Родитель) И (Не СпособСозданияГрупп = 0) Тогда
				Если СпособСозданияГрупп = 1 Тогда
					Группа = СоответствиеГрупп["К_"+СтрЗаменить(СокрЛП(Строка(Стр.ВидНоменклатуры))," ","_")];
				ИначеЕсли СпособСозданияГрупп = 2 Тогда
					Если Не СоответствиеГрупп.Свойство("К_"+СокрЛП(Стр.Родитель.Код), Группа) Тогда
						Если Не Родитель = Неопределено Тогда
							Группа = Родитель;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если Не Родитель = Неопределено Тогда
					Группа = Родитель;
				КонецЕсли;
			КонецЕсли;
			Если Не Группа = Неопределено Тогда
				НовыйЭлемент.Родитель = Группа;
			КонецЕсли;
			
			Если ПроверкаЭлемента(НовыйЭлемент,ВладелецПрайсЛиста) Тогда
				НовыйЭлемент.Записать();
			КонецЕсли;
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПрайсЛист()

// Проверяет, корректно ли заполнен новый элемент справочника
//
// Параметры:
//  Элемент		- СправочникСсылка	- Элемент справочника.
//
Функция ПроверкаЭлемента(Элемент, ВладелецПрайсЛиста)
	
	Разрешено = Истина;
	Если ВладелецПрайсЛиста.ФлагУникальности Тогда
		Разрешено = Разрешено И НЕ ЗначениеЗаполнено(Справочники.ПрайсЛист.НайтиПоРеквизиту("Номенклатура", Элемент.Номенклатура, , ВладелецПрайсЛиста));
		Если НЕ Разрешено Тогда
			ВывестиСообщение(НСтр("ru='Номенклатура ""%1"" не уникальна, элемент не добавлен.'"),,,,,Элемент.Номенклатура);
		КонецЕсли;
	КонецЕсли;
	Возврат Разрешено;
	
КонецФункции // ПроверкаЭлемента()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура НоменклатураПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Объект.Наименование = Объект.Номенклатура;
	
КонецПроцедуры // НоменклатураПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
